
'''
Как я хочу чтобы моим приложением пользовались.

Я хочу чтобы была единая точка доступа. например Game().
Ну и метод какойто play() который всетаки будет стартовать.

Для того чтобы оно работало мне нужно задать дефолт с чем работать будет моя программа.
Дефолтом является машина.

Без машины мы ничего не сделаем.

Мы можем конструировать вне игры и передавать сразу Машину. Либо мы можем предусмотреть какойто функционал для создания
всех деталей в нутри нашей игры.

Нужно понять плюсы и минусы. Каждого подхода.






Пусть каждая фабрика 


Очертить сначало задачи которые я хочу решить. Относительно машины.
Создание машины с нуля.
Получить придефолт.


Машину нужно создавать как.


Описать участников которые будут пользоваться моим приложением.
Клиенты.
Фабрики.

Клиенту дать доступ только к тому что выпустил завод.

Фабрике выдать досутп на создание машины.
'''
